modm-ext/data.modm.io/docs/svd/header_stm32wle4xx.svd
        <register>
          <name>PUCRA</name>
          <description>PWR Pull-Up Control Register of port A</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PA0</name>
              <description>Pin PA0 Pull-Up set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA1</name>
              <description>Pin PA1 Pull-Up set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA2</name>
              <description>Pin PA2 Pull-Up set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA3</name>
              <description>Pin PA3 Pull-Up set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA4</name>
              <description>Pin PA4 Pull-Up set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA5</name>
              <description>Pin PA5 Pull-Up set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA6</name>
              <description>Pin PA6 Pull-Up set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA7</name>
              <description>Pin PA7 Pull-Up set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA8</name>
              <description>Pin PA8 Pull-Up set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA9</name>
              <description>Pin PA9 Pull-Up set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA10</name>
              <description>Pin PA10 Pull-Up set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA11</name>
              <description>Pin PA11 Pull-Up set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA12</name>
              <description>Pin PA12 Pull-Up set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA13</name>
              <description>Pin PA13 Pull-Up set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA14</name>
              <description>Pin PA14 Pull-Up set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA15</name>
              <description>Pin PA15 Pull-Up set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRA</name>
          <description>PWR Pull-Down Control Register of port A</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PA0</name>
              <description>Pin PA0 Pull-Down set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA1</name>
              <description>Pin PA1 Pull-Down set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA2</name>
              <description>Pin PA2 Pull-Down set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA3</name>
              <description>Pin PA3 Pull-Down set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA4</name>
              <description>Pin PA4 Pull-Down set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA5</name>
              <description>Pin PA5 Pull-Down set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA6</name>
              <description>Pin PA6 Pull-Down set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA7</name>
              <description>Pin PA7 Pull-Down set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA8</name>
              <description>Pin PA8 Pull-Down set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA9</name>
              <description>Pin PA9 Pull-Down set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA10</name>
              <description>Pin PA10 Pull-Down set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA11</name>
              <description>Pin PA11 Pull-Down set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA12</name>
              <description>Pin PA12 Pull-Down set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA13</name>
              <description>Pin PA13 Pull-Down set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA14</name>
              <description>Pin PA14 Pull-Down set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA15</name>
              <description>Pin PA15 Pull-Down set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRB</name>
          <description>PWR Pull-Up Control Register of port B</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin PB0 Pull-Up set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin PB1 Pull-Up set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin PB2 Pull-Up set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin PB3 Pull-Up set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin PB4 Pull-Up set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin PB5 Pull-Up set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin PB6 Pull-Up set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin PB7 Pull-Up set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB8</name>
              <description>Pin PB8 Pull-Up set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB9</name>
              <description>Pin PB9 Pull-Up set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB10</name>
              <description>Pin PB10 Pull-Up set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB11</name>
              <description>Pin PB11 Pull-Up set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB12</name>
              <description>Pin PB12 Pull-Up set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB13</name>
              <description>Pin PB13 Pull-Up set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB14</name>
              <description>Pin PB14 Pull-Up set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB15</name>
              <description>Pin PB15 Pull-Up set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRB</name>
          <description>PWR Pull-Down Control Register of port B</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin PB0 Pull-Down set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin PB1 Pull-Down set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin PB2 Pull-Down set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin PB3 Pull-Down set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin PB4 Pull-Down set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin PB5 Pull-Down set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin PB6 Pull-Down set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin PB7 Pull-Down set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB8</name>
              <description>Pin PB8 Pull-Down set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB9</name>
              <description>Pin PB9 Pull-Down set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB10</name>
              <description>Pin PB10 Pull-Down set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB11</name>
              <description>Pin PB11 Pull-Down set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB12</name>
              <description>Pin PB12 Pull-Down set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB13</name>
              <description>Pin PB13 Pull-Down set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB14</name>
              <description>Pin PB14 Pull-Down set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB15</name>
              <description>Pin PB15 Pull-Down set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRC</name>
          <description>PWR Pull-Up Control Register of port C</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PC0</name>
              <description>Pin PC0 Pull-Up set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC1</name>
              <description>Pin PC1 Pull-Up set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC2</name>
              <description>Pin PC2 Pull-Up set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC3</name>
              <description>Pin PC3 Pull-Up set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC4</name>
              <description>Pin PC4 Pull-Up set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC5</name>
              <description>Pin PC5 Pull-Up set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC6</name>
              <description>Pin PC6 Pull-Up set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC13</name>
              <description>Pin PC13 Pull-Up set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC14</name>
              <description>Pin PC14 Pull-Up set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC15</name>
              <description>Pin PC15 Pull-Up set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRC</name>
          <description>PWR Pull-Down Control Register of port C</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PC0</name>
              <description>Pin PC0 Pull-Down set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC1</name>
              <description>Pin PC1 Pull-Down set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC2</name>
              <description>Pin PC2 Pull-Down set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC3</name>
              <description>Pin PC3 Pull-Down set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC4</name>
              <description>Pin PC4 Pull-Down set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC5</name>
              <description>Pin PC5 Pull-Down set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC6</name>
              <description>Pin PC6 Pull-Down set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC13</name>
              <description>Pin PC13 Pull-Down set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC14</name>
              <description>Pin PC14 Pull-Down set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC15</name>
              <description>Pin PC15 Pull-Down set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRH</name>
          <description>PWR Pull-Up Control Register of port H</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PH3</name>
              <description>Pin PH3 Pull-Up set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRH</name>
          <description>PWR Pull-Down Control Register of port H</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PH3</name>
              <description>Pin PH3 Pull-Down set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTSCR</name>
          <description>PWR Power Status Reset Register for CPU2</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>C1CSSF</name>
              <description>Clear standby and stop flags for CPU1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1SBF</name>
              <description>System standby flag for CPU1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1STOP2F</name>
              <description>System stop2 flag for CPU1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1STOPF</name>
              <description>System stop0 or stop1 flag for CPU1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1DS</name>
              <description>CPU1 deepsleep mode flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBGHZSPICR</name>
          <description>PWR SUBGHZSPI Control Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NSS</name>
              <description>Sub-GHz radio SUBGHZSPI_NSS control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
